# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a variable called cars1 and cars2

In [2]:
cars1=pd.read_csv('cars1.csv')
cars2=pd.read_csv('cars2.csv')
print(cars1.head(5),'\n',cars2.head(5))

    mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  18.0          8           307        130    3504          12.0     70
1  15.0          8           350        165    3693          11.5     70
2  18.0          8           318        150    3436          11.0     70
3  16.0          8           304        150    3433          12.0     70
4  17.0          8           302        140    3449          10.5     70

   origin                        car  Unnamed: 9  Unnamed: 10  Unnamed: 11  \
0       1  chevrolet chevelle malibu         NaN          NaN          NaN
1       1          buick skylark 320         NaN          NaN          NaN
2       1         plymouth satellite         NaN          NaN          NaN
3       1              amc rebel sst         NaN          NaN          NaN
4       1                ford torino         NaN          NaN          NaN

   Unnamed: 12  Unnamed: 13
0          NaN          NaN
1          NaN          NaN
2          NaN          NaN
3          NaN          NaN
4          NaN          NaN
     mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  33.0          4            91         53    1795          17.4     76
1  20.0          6           225        100    3651          17.7     76
2  18.0          6           250         78    3574          21.0     76
3  18.5          6           250        110    3645          16.2     76
4  17.5          6           258         95    3193          17.8     76

   origin                 car
0       3         honda civic
1       1      dodge aspen se
2       1   ford granada ghia
3       1  pontiac ventura sj
4       1       amc pacer d/l

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [15]:
cars1.iloc[:,:9] #1way
cars11=cars1.dropna(axis=1,how ='all')

### Step 5. What is the number of observations in each dataset?

In [16]:
print(len(cars11))
print(len(cars2))

198
200

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [21]:
cars = cars11.append(cars2)
cars.head(5)
#len(cars)==>398

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [23]:
import numpy as np
nr_owners = np.random.randint(15000, high=73001, size=398, dtype='l')
nr_owners

array([70876, 27243, 55030, 34464, 33352, 32442, 35194, 69871, 28315,
       46227, 65742, 32722, 47937, 27223, 36215, 66017, 25584, 40710,
       28595, 50859, 26079, 47259, 53861, 62416, 54326, 71002, 54751,
       32506, 71303, 38550, 66751, 72191, 52481, 30753, 17179, 26304,
       52529, 15199, 69896, 70179, 56189, 45573, 33025, 56402, 36248,
       46643, 66444, 40280, 35094, 48153, 34450, 49146, 22386, 35399,
       26073, 22712, 25902, 52607, 46446, 58008, 61667, 68567, 29304,
       16334, 28338, 24145, 33805, 71499, 20031, 49493, 57494, 61996,
       30714, 48967, 24677, 72551, 30130, 46269, 51044, 45999, 72435,
       21692, 65407, 32107, 69948, 19601, 66084, 31030, 51754, 29861,
       69704, 22485, 70836, 68522, 43054, 44473, 69553, 19783, 18618,
       57331, 49274, 69352, 62629, 68379, 68906, 57508, 25006, 34200,
       31201, 35272, 64418, 70050, 59635, 34170, 55880, 27299, 47449,
       51911, 26951, 69791, 22489, 70596, 27312, 22757, 29311, 30990,
       42917, 27549, 64632, 66335, 41799, 70605, 37754, 17826, 41559,
       43966, 66158, 39327, 46121, 68438, 21811, 42275, 71102, 40696,
       60843, 34203, 53894, 31467, 56803, 52090, 15843, 58294, 25940,
       46488, 54717, 48779, 19549, 62281, 18830, 20595, 43045, 65645,
       46465, 52116, 58524, 30083, 27422, 31589, 36341, 21023, 58850,
       48881, 63160, 27305, 71655, 40156, 57290, 37460, 21454, 40883,
       30499, 63244, 39099, 44180, 56127, 34641, 56787, 34204, 45885,
       42763, 38459, 31123, 24332, 44084, 22611, 51740, 40392, 38625,
       60316, 39506, 54740, 61951, 54355, 38421, 50594, 29807, 53043,
       70647, 69609, 66233, 34729, 16430, 30462, 47060, 18017, 23866,
       65983, 61382, 29496, 43968, 21344, 67205, 71308, 71572, 62412,
       20667, 70639, 64216, 29631, 52128, 45526, 69162, 69867, 67556,
       44024, 22607, 55943, 22103, 48560, 69393, 64548, 18284, 16952,
       15600, 49881, 53610, 16668, 60087, 44361, 43641, 23533, 37817,
       42945, 64035, 47103, 43156, 70723, 68976, 21292, 26857, 67679,
       53615, 25583, 55480, 56505, 64324, 50944, 29246, 58126, 36646,
       44740, 19676, 64984, 28078, 52872, 41799, 18083, 58018, 47095,
       65002, 70462, 29917, 54775, 45919, 67144, 46981, 34736, 19564,
       56281, 43009, 52784, 61195, 69691, 39488, 53397, 48537, 53201,
       23384, 41657, 37999, 44298, 33239, 23329, 38714, 49037, 28026,
       28479, 37660, 19368, 24130, 29442, 32170, 70767, 17387, 21037,
       25932, 62459, 50528, 67300, 42576, 30199, 22169, 38951, 17994,
       60193, 35471, 32763, 38014, 20203, 52184, 60862, 63986, 56644,
       55217, 19400, 45185, 29034, 21631, 16010, 31330, 18308, 51094,
       37951, 56008, 23394, 57329, 56064, 15458, 24404, 67361, 72429,
       38712, 68991, 40843, 54644, 25310, 16521, 67943, 17401, 70596,
       40459, 71315, 50650, 22514, 51528, 68291, 56382, 72860, 52408,
       54334, 39480, 19929, 56277, 56869, 59809, 41941, 48935, 47540,
       64851, 54001, 46686, 50508, 22435, 18973, 70974, 19126, 20852,
       20942, 50304, 30958, 32544, 63183, 65174, 23823, 60020, 17931,
       34097, 51729])

### Step 8. Add the column owners to cars

In [24]:
cars['owners']=nr_owners

In [25]:
cars.tail(5)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
195,27.0,4,140,86,2790,15.6,82,1,ford mustang gl,23823
196,44.0,4,97,52,2130,24.6,82,2,vw pickup,60020
197,32.0,4,135,84,2295,11.6,82,1,dodge rampage,17931
198,28.0,4,120,79,2625,18.6,82,1,ford ranger,34097
199,31.0,4,119,82,2720,19.4,82,1,chevy s-10,51729